import { Image } from 'antd';
import styles from '../../style.module.scss';

export const pm9300 = () => {
  const shortDescription = (
    <div className={styles.shortDescriptionContainer}>
      <p>
        Установка радиационная поверочная гамма-излучения закрытая УРПГЗ-РМ9300
        Установка радиационная поверочная гамма-излучения закрытая УРПГЗ-РМ9300
        предназначена для воспроизведения и передачи единиц кермы и мощности
        кермы в воздухе, экспозиционной дозы и мощности экспозиционной дозы,
        амбиентного эквивалента дозы и мощности амбиентного эквивалента дозы,
        индивидуального эквивалента дозы и мощности индивидуального эквивалента
        доз при поверке, калибровке, градуировке и испытаниях.
      </p>
      <p>
        Установка с комплектом источников может размещаться в помещениях, не
        требующих дополнительной радиационной защиты. Радиационное воздействие
        на персонал и население при эксплуатации, неисправности или аварии
        установки ограничивается самой установкой и не выходит в помещение, в
        котором она размещена.
      </p>
    </div>
  );

  const fullDescription = (
    <div className={styles.fullDescription}>
      <h2>Назначение установки</h2>

      <p>
        Установка радиационная поверочная гамма-излучения закрытая УРПГЗ-РМ9300,
        предназначена для воспроизведения и передачи единиц кермы и мощности
        кермы в воздухе, экспозиционной дозы и мощности экспозиционной дозы,
        амбиентного эквивалента дозы и мощности амбиентного эквивалента дозы,
        индивидуального эквивалента дозы и мощности индивидуального эквивалента
        доз при поверке, калибровке, градуировке и испытаниях дозиметров и
        измерителей мощности дозы гамма-излучения.
      </p>
      <h2>Безопасность эксплуатации установки</h2>
      <p>
        Установка с комплектом источников может размещаться в помещениях, не
        требующих дополнительной радиационной защиты. Радиационное воздействие
        на персонал и население при эксплуатации, неисправности или аварии
        установки ограничивается самой установкой и не выходит в помещение, в
        котором она размещена.
        <br />
        Радиационная безопасность эксплуатации установки обеспечивается системой
        управления совместно с системой сигнализации и блокировки, а также
        системой радиационного контроля с одним блоком детектирования
        гамма-излучения, расположенным в рабочей камере установки.
      </p>
      <h2>Метрологические характеристики</h2>
      <p>
        Общий вид установки показан на рисунке 1. На рисунке 2 показана
        установка со снятой верхней крышкой. Установка состоит из трех основных
        частей (рисунок 2) -облучателя (5), рабочей камеры (2) и станции
        управления установкой (4), объединенных в едином корпусе. В рабочей
        камере установки размещается система линейного перемещения рабочего
        стола (далее СЛП) (3) и блок аттенюаторов (1). Рабочая камера со всех
        сторон закрыта свинцовой защитой различной толщины. Поверяемые приборы
        размещаются на рабочем столе СЛП. Рабочий стол имеет возможность
        регулировки по высоте при помощи электропривода, а также перемещения
        поверяемого прибора по оси (ось Х) излучения на расстояния от 35 см до
        90 см, относительно источника. Точность позиционирования рабочего стола
        по оси Х не более 0,2 мм. Блок аттенюаторов (1), состоящий из 4
        свинцовых аттенюаторов обеспечивает ослабление потока излучения от
        источника. Станция управления (4) при помощи электроприводов
        обеспечивает дистанционную подачу источников в облучателе (5) из
        положения хранения в рабочее положение и обратно, позиционирование
        поверяемых приборов в пучке излучения по оси Х, регулировку рабочего
        стола по высоте и установку комбинаций аттенюаторов.
      </p>

      <Image
        style={{ width: '50vw' }}
        src="../../../../../.././assets/productsImages/gamma-radiation-calibration-equipment/pm9300/images/qjbp2mtp7pdjz1gyyxl5y40tq3u3595n.webp"
      />
      <Image
        style={{ width: '50vw' }}
        src="../../../../../.././assets/productsImages/gamma-radiation-calibration-equipment/pm9300/images/881zx610wtmxtan9b6cokbj8alid65tx.webp"
      />
      <p>
        Загрузка приборов на рабочий стол СЛП осуществляется через дверь (3)
        (рисунок 1). С центрального (1) и наладочного (2) пультов можно
        осуществлять управление всеми механизмами установки в наладочном и
        полуавтоматическом режимах.
        <br />
        Установка имеет возможность работы в автоматическом режиме.
        <br />
        СЛП обеспечивает удобное центрирование детектора в пучке излучения с
        использованием лазерных устройств.
        <br />
        Система видеонаблюдения состоит из трех видеокамер, которые обеспечивают
        контроль за положением платформы СЛП по рулетке, наблюдением за
        показаниями приборов и обзор рабочей камеры.
      </p>
      <h2>Конструктивные особенности установки</h2>
      <p>
        Установка имеет сборно-разборную конструкцию и состоит из несущей рамы,
        на которую устанавливаются элементы установки и свинцовая защита. Части
        установки заносятся в помещение, в котором она должна размещаться.
        Сборка установки осуществляется на месте размещения. Облучатель
        установки состоит из трех частей (рисунок 3) – нижний контейнер (1),
        верхний контейнер (3) и коллимационное устройство (2). По центру
        облучателя проходит вертикальный канал, по которому перемещаются
        пробки-держатели с источниками (5, 6), вертикальный канал снизу и сверху
        закрыт защитными пробками (4, 7). Коллимационное устройство имеет
        цилиндрический коллиматор (8), через который осуществляется облучение
        приборов. Установка оснащена 6 регулируемыми по высоте опорами.
        Установка оснащена двумя специальными колесными блоками, при помощи
        которых она может перемещаться на небольшие расстояния (внутри комнаты)
        в собранном виде.
        <br />В комплект поставки входит специальное разборное приспособление с
        набором такелажных строп и захватов, с помощью которого осуществляется
        монтаж тяжелых элементов установки.
      </p>

      <Image
        src="../../../../../.././assets/productsImages/gamma-radiation-calibration-equipment/pm9300/images/3en5tkq2icfdlhrybkdrc9b1yyjt506m.webp"
        style={{ width: '50vw' }}
      />
    </div>
  );

  const characteristics = {
    ['Диапазон воспроизведения мощности кермы в воздухе (МКВ)']: (
      <span>от 1,0 мкГр/ч до 14 Гр/ч</span>
    ),
    ['Диапазон воспроизведения мощности экспозиционной дозы (МЭД)']: (
      <span>от 114,0 мкР/ч до 1600 Р/ч</span>
    ),
    ['Диапазон воспроизведения мощности амбиентного эквивалента дозы (МАЭД)']: (
      <span>от 1,2 мкЗв/ч до 16,7 Зв/ч</span>
    ),
    ['Диапазон воспроизведения мощности индивидуального эквивалента дозы (МИЭД)']:
      <span>от 1,2 мкЗв/ч до 16,9 Зв/ч</span>,
    ['Доверительные границы относительных погрешностей единиц мощности амбиентного эквивалента дозы (МАЭД), мощности индивидуального эквивалента дозы (МИЭД) при доверительной вероятности 0.95 при аттестации установки в качестве']:
      (
        <span>
          не более 7,0 % при поверке установки в качестве рабочего эталона 2-го
          разряда <br /> не более 10,0 % при поверке установки в качестве
          рабочего эталона 3-го разряда
        </span>
      ),

    ['Доверительные границы относительных погрешностей единиц мощности кермы в воздухе (МКВ), мощности экспозиционной дозы (МЭД) при доверительной вероятности 0.95 при аттестации установки в качестве']:
      (
        <span>
          не более 5 % при поверке установки в качестве рабочего эталона 2-го
          разряда <br /> не более 8 % при поверке установки в качестве рабочего
          эталона 3-го разряда
        </span>
      ),

    ['Относительная погрешность определения расстояния от центра источника до центра детектора дозиметрического прибора, не более']:
      <span>± 0,15 %</span>,
    ['Количество источников']: <span>до 2 шт.</span>,
    ['Максимальное значение активности источника 137Cs, не более']: (
      <span>
        2,4*10<sup>13</sup>Бк (650 Ки)
      </span>
    ),
    ['Максимальное значение суммарной активности источников 137Cs, не более']: (
      <span>
        2,5*10<sup>13</sup> Бк (680 Ки)
      </span>
    ),
    ['Время выхода на рабочий режим']: <span>1 мин.</span>,
    ['Время перевода источника из положения хранения/рабочего в положение рабочее/хранения не более, сек']:
      <span>15</span>,
    ['Диаметр равномерного поля установки, не менее']: (
      <span>
        - на расстоянии 0,5 м от источника гамма-излучения <br /> - 160 мм, при
        равномерности поля не более 6 % <br /> - 180 мм, при равномерности поля
        не более 9 %
      </span>
    ),

    ["МАЭД на поверхности корпуса, при нахождении источника в положении 'хранение', не более"]:
      <span>0,5 мкЗв/ч</span>,
    ['МАЭД вблизи корпуса, при нахождении источника в рабочем положении, не более']:
      <span>2 мкЗв/ч на расстоянии 30 см от корпуса</span>,
    ['Габаритные размеры рабочего стола']: <span>210x300 мм.</span>,
    ['Габаритные размеры проёма двери в рабочей камере']: (
      <span>460х460 мм.</span>
    ),
    ['Диаметры выходного отверстия канала коллиматора']: <span>90 мм</span>,
    ['Длина канала коллиматора (от центра источника)']: <span>150 мм</span>,
    ['Интервал перемещений рабочего стола по координате Z (по высоте), не менее']:
      <span>150 мм</span>,
    ['Интервал рабочих расстояний (по координате Х) от центра источника до детектора дозиметрического прибора']:
      <span>от 300 до 1000 мм</span>,
    ['Скорость перемещения подвижной платформы (ось Х)']: (
      <span>от 0,5 мм/с до 0,1 м/с</span>
    ),
    ['Габариты']: <span>1860х880х1620 мм</span>,
    ['Масса']: <span>3500 кг.</span>,
    ['Масса приборов, устанавливаемых на рабочем столе, не более, кг']: (
      <span>30</span>
    ),
    ['Время непрерывной работы установки, не менее']: (
      <span>24 ч (круглосуточно)</span>
    ),
    ['Среднее время восстановления']: <span>не более 6 ч.</span>,
    ['Средний срок службы']: <span>не менее 15 лет</span>,
    ['Средняя наработка на отказ, не менее']: <span>60 000 ч.</span>,
    ['Атмосферное давление']: <span>от 84,0 до 106,7 кПа</span>,
    ['Диапазон рабочих температур']: <span>от 10 °С до 35 °С</span>,
    ['Относительная влажность']: <span>от 45 % до 80 %</span>,
    ['Напряжение питания']: <span>230 В ± 10%</span>,
    ['Потребляемая мощность']: <span>не более 600 ВА</span>,
  };

  const characteristicsShortDescription = (
    <div>
      {Object.entries(characteristics)
        .slice(0, 6)
        .map(([key, value]) => (
          <div className={styles.characteristics} key={key}>
            <span style={{ color: 'rgba(0, 0, 0, 0.45)' }}>{key}</span> -{' '}
            <span>{value}</span>
          </div>
        ))}
    </div>
  );
  return {
    characteristicsShortDescription,
    shortDescription,
    characteristics,
    fullDescription,
  };
};
